Домашнее задание к занятию 1.4 Типы данных в Java: примитивы

Необходимо выполнить и предоставить на проверку следующие задачи:

 1.   ИПшник

Дополнительная задача со * :

 2. *   Сравнение double


Задача 1. ИПшник

ВАЖНО: Перед отправкой домашнего задания, убедитесь, что вы соблюдаете все правила форматирования кода: от правила именований, до пробелов и отступов (последнее можно исправлять автоматически в идее через Code -> Reformat code).
Описание

Нужно написать программу-помощника индивидуальному предпринимателю (далее - ИП), которая помогает ему выбрать лучшую систему налогооблажения. ИП будет заносить суммы доходов и расходов, а программа будет выбирать для него лучшую систему налогообложения из двух:

    УСН доходы - налог 6% от доходов;
    УСН доходы минус расходы - налог 15% от разницы доходов и расходов.

Функционал программы

    Ввод сумм доходов и расходов ИП;
    ИП может несколько раз вносить доходы и расходы, они должны суммироваться с введёнными ранее данными;
    При выборе ИП опции определения наиболее выгодной системы налогообложения, программа должна вывести название такой системы (УСН доходы или УСН доходы минус расходы);
    При выводе самой выгодной системы налогооблажения, программа должна вывести также сумму, которую удастся сэкономить, если выбрать эту систему;
    Программа должна завершаться при вводе слова end;
    Нужно помнить, что налог не может быть отрицательным;
    Программа должна быть структурирована в методы (например, расчёт налога для одной системы налогооблажения должен представлять собой отдельный статический метод)

Пример

Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
1 <Enter>
Введите сумму дохода:
400 <Enter>

Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
2 <Enter>
Введите сумму расхода:
100 <Enter>

Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
1 <Enter>
Введите сумму дохода:
600 <Enter>

Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
3 <Enter>

Мы советуем вам УСН доходы
Ваш налог составит: 60 рублей
Налог на другой системе: 135 рублей
Экономия: 75 рублей

Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
end <Enter>

Программа завершена!

Такой вывод программы основан на следующих расчётах:

    Доходы ИП: 400 + 600 = 1000 рублей
    Расходы ИП: 100 рублей
    УСН доходы: 6% от 1000 рублей = 60 рублей
    УСН доходы минус расходы: 15% от 1000-100 рублей = 135 рублей
    Экономия: 135 - 60 = 75 рублей

Задача 2. Сравнение double

ВАЖНО: Перед отправкой домашнего задания, убедитесь, что вы соблюдаете все правила форматирования кода: от правила именований, до пробелов и отступов (последнее можно исправлять автоматически в идее через Code -> Reformat code).
Описание

Напишем программу для сравнения double, float и округления этих типов
Функционал программы

    Ввод номера желаемой операции (сравнить/округлить/отбросить дробную часть);
    Ввод двух чисел для сравнения (одно double, другое float) или одного (для округления или отброса дробной части);
    Вывод результата.

Пример

Операции над double/float
1. Сравнить
2. Округлить
3. Отбросить дробную часть

1 <enter>
Введите первое число:
0.33 <enter>
Введите второе число:
0.33 <enter>
Результат:
числа равны

Процесс реализации

    При запуске программы выведем возможные операции над числами с помощью System.out.println

    Выберем операцию:

    для отброса дробной части — можно привести к типу long;
    для сравнения — вычесть одно число из другого и проверить разницу с учётом погрешности; если они оказываются не равны, то указать какое из них больше;
    для округления — воспользуемся Math.round(value).

    Выведем результат.
